package shujia25.day01;
/*
    标识符：就是起名字时定义的规则
    规则：
        1.数字不能开头
        2.可以存在$和_，并且可以开头
        3.不能包含除$和_以外的特殊字符（空格是空白字符）
        4.自己起的名字不能与关键字重名

    规范：遵循见名知意的原则

    常见的起名字的场景：
        包（其实就是文件夹，用于解决相同类名问题）特点：所有字母都小写
            一个单词构成：day01
            多个单词构成：shujia
            多级文件夹：shujia.day01

        类或者接口 特点：由英文大小写字母和数字构成
            一个单词构成：首字母大写，其余字母小写  举例：Student
            多个单词构成：每个单词首字母大写，其余字母小写  举例：MakeNameDemo

        方法和变量
            一个单词构成：所以字母小写  举例：eat
            多个单词构成：第一个单词全部小写，从第二个单词开始，首字母大写，其余字母小写  举例：playGame

        常量
            一个单词构成：所以字母大写  举例：NAME
            多个单词构成：所以字母大写，并且单词与单词之间使用_连接  举例：FIRST_NAME

 */
public class MakeNameDemo {
}
