package shujia25.day02;

/*
    十进制与二进制之间的快速转换: 8421码
    1byte = 8bit  位
    1kb = 1024byte
    1Mb = 1024kb
    1Gb = 1024Mb
    1Tb = 1024Gb
    1Pb = 1024Tb

    二进制:                 1   1   1   1   1   1   1   1
    每一位对应的十进制:       128 64  32  16  8   4   2   1

    举例:11011000 --- >  128+64+16+8=?

    需求1: 100转成二进制   --> 01100100
    100/2 = 50 ---- 0
    50/2  = 25 ---- 0
    25/2  = 12 ---- 1
    12/2  = 6  ---- 0
    6/2   = 3  ---- 0
    3/2   = 1  ---- 1
    1/2   = 0  ---- 1
 */

/*
    二进制到八进制:  规律: 从右往左每三位一组, 不足三位的,左边用0补齐,计算每一组的十进制,然后拼接得到八进制
    100110 => 46

    二进制到十六进制: 规律: 从右往左每四位一组, 不足四位的,左边用0补齐,计算每一组的十进制,然后拼接得到十六进制
    100110 => 26


 */
public class ConstantDemo2 {
}
