package shujia25.day06.test;

/*
        2. 某公司要开发名为”我爱购物狂”的购物网站，请使用面向对象的思想设计描述商品信息
            要求：
            1)分析  商品类别  和    商品详细信息   属性和方法，设计  商品类别类  和   商品详细信息类
            2)在   商品详细信息类  中通过  属性 描述该商品所属类别
            3)设置属性的私有访问权限，通过公有的 get,set 方法实现对属性的访问
            4)编写测试类，测试商品类别类和商品详细信息类的对象及相关方法（测试数据  信息自定）
            5)创建包 info—存放商品类别类和商品详细信息类，创建包 test—存放测试类
            参考分析思路:
                商品类别类：
                属性： 类别编号，类别名称
                商品详细信息类：
                属性： 商品编号 ，商品名称，所属类别，商品数量（大于 0），商品价格（大于 0），
                方法： 盘点的方法，描述商品信息。内容包括商品名称，商品数量，商品价格，  现在商品总价以及所属类别信息


 */
public class HomeDemo4 {
}
